dhzl84/ESP8266-Smart-Home/src/main.cpp
void GPIO_CONFIG(void)
{
   /* initialize encoder pins */
   pinMode(ENCODER_PIN1, INPUT_PULLUP);
   pinMode(ENCODER_PIN2, INPUT_PULLUP);
   pinMode(ENCODER_BUTTON_PIN, INPUT_PULLUP);
}

/* Display */
void DISPLAY_INIT(void)
{
   #ifdef CFG_DEBUG
   Serial.println("Initialize display");
   #endif
   Wire.begin();   /* needed for I²C communication with display */
   myDisplay.init();
   myDisplay.flipScreenVertically();
   myDisplay.clear();
   myDisplay.setFont(Roboto_Condensed_16);
   myDisplay.setTextAlignment(TEXT_ALIGN_CENTER);
   myDisplay.drawString(64, 4, "Initialize");
   myDisplay.drawString(64, 24, String(myConfig.name));
   myDisplay.drawString(64, 44, FIRMWARE_VERSION);
   myDisplay.display();
}

void WIFI_CONNECT(void)
{
   WiFiConnectCounter++;
   /* init WiFi */
   if (WiFi.status() != WL_CONNECTED)
   {
      #ifdef CFG_DEBUG
      Serial.println("Initialize WiFi ");
      #endif

      WiFi.mode(WIFI_STA);
      WiFi.setSleepMode(WIFI_NONE_SLEEP);
      WiFi.begin(myConfig.ssid, myConfig.wifiPwd);

      /* try to connect to WiFi, proceed offline if not connecting here*/
      if (WiFi.waitForConnectResult() != WL_CONNECTED)
      {
         Serial.println("Failed to connect to WiFi, continue offline");
      }
   }

   #ifdef CFG_DEBUG
   Serial.println("WiFi Status: "+ String(WiFi.status()));
   #endif

   Serial.print("IP address: ");
   Serial.println(WiFi.localIP());
}

/* OTA */
void OTA_INIT(void)
{
   ArduinoOTA.setHostname((myMqttHelper.getLoweredName()).c_str());

   ArduinoOTA.onStart([]()
   {
      myMqttClient.disconnect();
      OTA_UPDATE = TH_OTA_ACTIVE;
      DRAW_DISPLAY_MAIN();
      Serial.println("Start");
   });

   ArduinoOTA.onEnd([]()
   {
      OTA_UPDATE = TH_OTA_FINISHED;
      DRAW_DISPLAY_MAIN();
      Serial.println("\nEnd");
   });

   ArduinoOTA.onProgress([](unsigned int progress, unsigned int total)
   {
      Serial.printf("Progress: %u%%\r", (progress / (total / 100)));
   });

   ArduinoOTA.onError([](ota_error_t error)
   {
      OTA_UPDATE = TH_OTA_ERROR;
      DRAW_DISPLAY_MAIN();
      Serial.printf("Error[%u]: ", error);
      if (error == OTA_AUTH_ERROR) Serial.println("Auth Failed");
      else if (error == OTA_BEGIN_ERROR) Serial.println("Begin Failed");
      else if (error == OTA_CONNECT_ERROR) Serial.println("Connect Failed");
      else if (error == OTA_RECEIVE_ERROR) Serial.println("Receive Failed");
      else if (error == OTA_END_ERROR) Serial.println("End Failed");
      SYSTEM_RESTART_REQUEST = true;
   });
   ArduinoOTA.begin();
}

void MQTT_CONNECT(void)
{
   MQTTConnectCounter++;
   if (WiFi.status() == WL_CONNECTED)
   {
      if (!myMqttClient.connected())
      {
         myMqttClient.disconnect();
         myMqttClient.begin(myConfig.mqttHost, myConfig.mqttPort, myWiFiClient);
         myMqttClient.setWill((myMqttHelper.getTopicLastWill()).c_str(),   "offline", true, MQTT_QOS);     /* broker shall publish 'offline' on ungraceful disconnect >> Last Will */
         myMqttClient.onMessage(messageReceived);                                                        /* register callback */
         (void)myMqttClient.connect((myMqttHelper.getLoweredName()).c_str(), myConfig.mqttUser, myConfig.mqttPwd);

         homeAssistantDiscovery();  /* make HA discover necessary devices */
         
         myMqttClient.publish(myMqttHelper.getTopicLastWill(),             "online", true,  MQTT_QOS);   /* publish online in will topic */
         myMqttClient.publish(myMqttHelper.getTopicSystemRestartRequest(), "0",      false, MQTT_QOS);   /* publish restart = false on connect */

         /* subscribe topics */
         (void)myMqttClient.subscribe(myMqttHelper.getTopicTargetTempCmd(),         MQTT_QOS);
         (void)myMqttClient.subscribe(myMqttHelper.getTopicThermostatModeCmd(),     MQTT_QOS);
         (void)myMqttClient.subscribe(myMqttHelper.getTopicUpdateFirmware(),        MQTT_QOS);
         (void)myMqttClient.subscribe(myMqttHelper.getTopicChangeName(),            MQTT_QOS);
         (void)myMqttClient.subscribe(myMqttHelper.getTopicChangeHysteresis(),      MQTT_QOS);
         (void)myMqttClient.subscribe(myMqttHelper.getTopicChangeSensorCalib(),     MQTT_QOS);
         (void)myMqttClient.subscribe(myMqttHelper.getTopicSystemRestartRequest(),  MQTT_QOS);
      }
   }
}

/*===================================================================================================================*/
/* The loop function is called in an endless loop */
/*===================================================================================================================*/
void loop()
{
  /* call every 50 ms */
  if (TimeReached(loop50msMillis))
  {
    SetNextTimeInterval(loop50msMillis, loop50ms);
    /* nothing yet */
  }
  /* call every 100 ms */
  if (TimeReached(loop100msMillis))
  {
    SetNextTimeInterval(loop100msMillis, loop100ms);
    HANDLE_SYSTEM_STATE();   /* handle connectivity and trigger reconnects */
    myThermostat.loop();     /* control relay for heating */
    MQTT_MAIN();             /* handle MQTT each loop */
    DRAW_DISPLAY_MAIN();     /* draw display each loop */
  }
  /* call every 500 ms */
  if (TimeReached(loop500msMillis))
  {
    SetNextTimeInterval(loop500msMillis, loop500ms);
    /* nothing yet */
  }
  /* call every second */
  if (TimeReached(loop1000msMillis))
  {
    SetNextTimeInterval(loop1000msMillis, loop1000ms);
    SENSOR_MAIN();          /* get sensor data */
    SPIFFS_MAIN();          /* check for new data and write SPIFFS is necessary */
    HANDLE_HTTP_UPDATE();   /* pull update from server if it was requested via MQTT*/
  }

  webServer.handleClient();
  myMqttClient.loop();
  delay(10);
  ArduinoOTA.handle();
}

/*===================================================================================================================*/
/* functions called by loop() */
/*===================================================================================================================*/
void HANDLE_SYSTEM_STATE(void)
{
   if (SYSTEM_RESTART_REQUEST == true)
   {
      DRAW_DISPLAY_MAIN();
      SYSTEM_RESTART_REQUEST = false;
      Serial.println("Restarting in 3 seconds");
      myMqttClient.disconnect();
      delay(3000);
      ESP.restart();
   }

