dhzl84/ESP8266-Smart-Home/src/main.cpp
   /* check WiFi connection every 30 seconds*/
   if (TimeReached(wifiReconnectTimer))
   {
      SetNextTimeInterval(wifiReconnectTimer, (WIFI_RECONNECT_TIME * secondsToMillisecondsFactor));
      if (WiFi.status() != WL_CONNECTED)
      {
         #ifdef CFG_DEBUG
         Serial.println("Lost WiFi; Status: "+ String(WiFi.status()));
         #endif
         /* try to come online, debounced to avoid reconnect each loop*/
         WIFI_CONNECT();
      }
   }
   /* check if rotary encoder button is pushed for 10 seconds to request a reset */
   if (LOW == digitalRead(ENCODER_BUTTON_PIN))
   {
      #ifdef CFG_DEBUG_ENCODER
      Serial.println("Encoder Button pressed: "+ String(digitalRead(ENCODER_BUTTON_PIN)));
      Serial.println("Target Time: "+ String(switchSystemResetTime + switchSystemResetInterval));
      Serial.println("Current time: "+ String(millis()));
      #endif

      if (switchSystemResetTime + switchSystemResetInterval < millis())
      {
         SYSTEM_RESTART_REQUEST = true;
      }
      else
      {
         /* waiting */
      }
   }
   else
   {
      switchSystemResetTime = millis();
   }
}

void SENSOR_MAIN()
{
   float dhtTemp;
   float dhtHumid;

   /* schedule routine for sensor read */
   if (TimeReached(readSensorScheduled))
   {
      SetNextTimeInterval(readSensorScheduled, (myConfig.sensUpdInterval * secondsToMillisecondsFactor));

      /* Reading temperature or humidity takes about 250 milliseconds! */
      /* Sensor readings may also be up to 2 seconds 'old' (its a very slow sensor) */
      dhtHumid = myDHT.getHumidity();
      dhtTemp  = myDHT.getTemperature();

      /* Check if any reads failed */
      if (isnan(dhtHumid) || isnan(dhtTemp)) {
         myThermostat.setLastSensorReadFailed(true);   /* set failure flag and exit SENSOR_MAIN() */
         #ifdef CFG_DEBUG
         Serial.println("Failed to read from DHT sensor! Failure counter: " + String(myThermostat.getSensorFailureCounter()));
         #endif
      }
      else
      {
         myThermostat.setLastSensorReadFailed(false);   /* set no failure during read sensor */

         myThermostat.setCurrentHumidity((int)(10* dhtHumid));     /* read value and convert to one decimal precision integer */
         myThermostat.setCurrentTemperature((int)(10* dhtTemp));   /* read value and convert to one decimal precision integer */

         #ifdef CFG_DEBUG
         Serial.print("Temperature: ");
         Serial.print(intToFloat(myThermostat.getCurrentTemperature()),1);
         Serial.println(" *C ");
         Serial.print("Filtered temperature: ");
         Serial.print(intToFloat(myThermostat.getFilteredTemperature()),1);
         Serial.println(" *C ");

         Serial.print("Humidity: ");
         Serial.print(intToFloat(myThermostat.getCurrentHumidity()),1);
         Serial.println(" %");
         Serial.print("Filtered humidity: ");
         Serial.print(intToFloat(myThermostat.getFilteredHumidity()),1);
         Serial.println(" %");
         #endif

         #ifdef CFG_PRINT_TEMPERATURE_QUEUE
         for (int i = 0; i < CFG_MEDIAN_QUEUE_SIZE; i++)
         {
            int temperature;
            int humidity;
            if ( (myTemperatureFilter.getRawSampleValue(i,&temperature)) && (myHumidityFilter.getRawSampleValue(i,&humidity)))
            {
               Serial.print("Sample ");
               Serial.print(i);
               Serial.print(": ");
               Serial.print(intToFloat(temperature),1);
               Serial.print(", ");
               Serial.println(intToFloat(humidity),1);
            }
         }
         #endif
      }
   }
}

void DRAW_DISPLAY_MAIN(void)
{
   myDisplay.clear();

   myDisplay.setContrast(50);

   if (SYSTEM_RESTART_REQUEST == true)
   {
      myDisplay.setFont(Roboto_Condensed_16);
      myDisplay.setTextAlignment(TEXT_ALIGN_CENTER);
      myDisplay.drawString(64,22,"Restart");
   }
   /* OTA */
   else if (OTA_UPDATE != TH_OTA_IDLE)
   {
      myDisplay.setFont(Roboto_Condensed_16);
      myDisplay.setTextAlignment(TEXT_ALIGN_CENTER);
      switch (OTA_UPDATE) {
         case TH_OTA_ACTIVE:
            myDisplay.drawString(64,22,"Update");
            break;
         case TH_OTA_FINISHED:
            myDisplay.drawString(64,11,"Finished,");
            myDisplay.drawString(64,33,"restarting");
            break;
         case TH_OTA_ERROR:
            myDisplay.drawString(64,22,"Error");
            break;
         case TH_OTA_IDLE:
            break;
      }
   }
   /* HTTP Update */
   else if (FETCH_UPDATE == true)
   {
      myDisplay.setFont(Roboto_Condensed_16);
      myDisplay.setTextAlignment(TEXT_ALIGN_CENTER);
      myDisplay.drawString(64,22,"Update");
   }
   else
   {
      myDisplay.setTextAlignment(TEXT_ALIGN_RIGHT);
      myDisplay.setFont(Roboto_Condensed_32);

      if (myThermostat.getSensorError())
      {
         myDisplay.drawString(128, drawTempYOffset, "err");
      }
      else
      {
         myDisplay.drawString(128, drawTempYOffset, String(intToFloat(myThermostat.getFilteredTemperature()),1));
      }

      /* do not display target temperature if heating is not allowed */
      if (myThermostat.getThermostatMode() == TH_HEAT)
      {
         myDisplay.setFont(Roboto_Condensed_16);
         myDisplay.drawString(128, drawTargetTempYOffset, String(intToFloat(myThermostat.getTargetTemperature()),1));

         if (myThermostat.getActualState()) /* heating */
         {
            myDisplay.drawHeating;
         }
      }
   }
   #ifdef CFG_DEBUG_DISPLAY_VERSION
   myDisplay.setTextAlignment(TEXT_ALIGN_LEFT);
   myDisplay.setFont(Roboto_Condensed_16);
   myDisplay.drawString(0, drawTargetTempYOffset, String(VERSION));
   #endif

   myDisplay.display();
}

void MQTT_MAIN(void)
{
   if( (myMqttClient.connected() != true) || (myMqttClient.returnCode() != LWMQTT_CONNECTION_ACCEPTED) )
   {
      if (TimeReached(mqttReconnectTime))
      {
         MQTT_CONNECT();
         SetNextTimeInterval(mqttReconnectTime, mqttReconnectInterval); /* reset interval if MQTT_CONNECT was called*/
      }
      else  /* try reconnect to MQTT broker after mqttReconnectTime expired */
      {
        /* just wait */
      }
   }
   else
   {
      /* check if there is new data to publish and shift PubCycle if data is published on event, else publish every PubCycleInterval */
      if ( TimeReached(mqttPubCycleTime) || myThermostat.getNewData() )
      {
         myThermostat.resetNewData();
         SetNextTimeInterval(mqttPubCycleTime, myConfig.mqttPubCycleInterval * minutesToMillisecondsFactor);
         mqttPubState();
      }
   }
}

