dhzl84/ESP8266-Smart-Home/src/main.cpp
void HANDLE_HTTP_UPDATE(void)
{
   if (FETCH_UPDATE == true)
   {
      /* publish and loop here before fetching the update */
      myMqttClient.publish(myMqttHelper.getTopicUpdateFirmwareAccepted(), String(false), false, MQTT_QOS); /* publish accepted update with value false to reset the switch in Home Assistant */
      myMqttClient.loop();

      DRAW_DISPLAY_MAIN();
      FETCH_UPDATE = false;
      Serial.printf("Remote update started");

      t_httpUpdate_return ret = ESPhttpUpdate.update(myConfig.updServer);

      switch(ret) {
          case HTTP_UPDATE_FAILED:
              Serial.printf("HTTP_UPDATE_FAILD Error (%d): %s", ESPhttpUpdate.getLastError(), ESPhttpUpdate.getLastErrorString().c_str());
              break;

          case HTTP_UPDATE_NO_UPDATES:
             Serial.println("HTTP_UPDATE_NO_UPDATES");
              break;

          case HTTP_UPDATE_OK:
             Serial.println("HTTP_UPDATE_OK");
              break;
      }
   }
}

void SPIFFS_MAIN(void)
{
   if (myMqttHelper.getNameChanged())
   {
      strlcpy(myConfig.name, myMqttHelper.getName().c_str(), sizeof(myConfig.name));
      if (saveConfiguration(myConfig))
      {
         /* write successful, restart to rebuild MQTT topics etc. */
         SYSTEM_RESTART_REQUEST = true;
      }
      else
      {
         /* write failed, retry next loop */
      }
   }

   /* avoid extensive writing to SPIFFS, therefore check if the target temperature didn't change for a certain time before writing. */
   if( (myThermostat.getNewCalib()) || (myThermostat.getTargetTemperature() != myConfig.tTemp) || (myThermostat.getThermostatHysteresis() != myConfig.tHyst) )
   {
      SPIFFS_REFERENCE_TIME = millis();  // ToDo: handle wrap around
      myConfig.tTemp  = myThermostat.getTargetTemperature();
      myConfig.calibF = myThermostat.getSensorCalibFactor();
      myConfig.calibO = myThermostat.getSensorCalibOffset();
      myConfig.tHyst  = myThermostat.getThermostatHysteresis();
      myThermostat.resetNewCalib();
      SPIFFS_WRITTEN = false;
   }
   else /* target temperature not changed this loop */
   {
      if (SPIFFS_WRITTEN == true)
      {
         /* do nothing, last change was already stored in SPIFFS */
      }
      else /* latest change not stored in SPIFFS */
      {
         if (SPIFFS_REFERENCE_TIME + SPIFFS_WRITE_DEBOUNCE < millis()) /* check debounce */
         {
            /* debounce expired -> write */
            if (saveConfiguration(myConfig))
            {
               SPIFFS_WRITTEN = true;
            }
            else
            {
               /* SPIFFS not written, retry next loop */
            }
         }
         else
         {
            /* debounce SPIFFS write */
         }
      }
   }
}
/*===================================================================================================================*/
/* callback, interrupt, timer, other functions */
/*===================================================================================================================*/

void ICACHE_RAM_ATTR encoderSwitch(void)
{
   /* debouncing routine for encoder switch */
   if (TimeReached(switchDebounceTime))
   {
      SetNextTimeInterval(switchDebounceTime, switchDebounceInterval);
      myThermostat.toggleThermostatMode();
   }
}

void ICACHE_RAM_ATTR updateEncoder(void)
{
   int MSB = digitalRead(ENCODER_PIN1);
   int LSB = digitalRead(ENCODER_PIN2);

   int encoded = (MSB << 1) |LSB;  /* converting the 2 pin value to single number */

   int sum  = (LAST_ENCODED << 2) | encoded; /* adding it to the previous encoded value */

   if(sum == 0b1101 || sum == 0b0100 || sum == 0b0010 || sum == 0b1011) /* gray patterns for rotation to right */
   {
      ROTARY_ENCODER_DIRECTION_INTS += rotRight; /* count rotation interrupts to left and right, this shall make the encoder routine more robust against bouncing */
   }
   if(sum == 0b1110 || sum == 0b0111 || sum == 0b0001 || sum == 0b1000)  /* gray patterns for rotation to left */
   {
      ROTARY_ENCODER_DIRECTION_INTS += rotLeft;
   }

   if (encoded == 0b11) /* if the encoder is in an end position, evaluate the number of interrupts to left/right. simple majority wins */
   {
      #ifdef CFG_DEBUG_ENCODER
      Serial.println("Rotary encoder interrupts: " + String(ROTARY_ENCODER_DIRECTION_INTS));
      #endif

      if(ROTARY_ENCODER_DIRECTION_INTS > rotRight) /* if there was a higher amount of interrupts to the right, consider the encoder was turned to the right */
      {
          myThermostat.increaseTargetTemperature(tempStep);
       }
      else if (ROTARY_ENCODER_DIRECTION_INTS < rotLeft) /* if there was a higher amount of interrupts to the left, consider the encoder was turned to the left */
      {
          myThermostat.decreaseTargetTemperature(tempStep);
       }
      else
      {
         /* do nothing here, left/right interrupts have occurred with same amount -> should never happen */
      }
      ROTARY_ENCODER_DIRECTION_INTS = rotInit; /* reset interrupt count for next sequence */
   }

   LAST_ENCODED = encoded; /* store this value for next time */
}

   /* Home Assistant discovery on connect; used to define entities in HA to communicate with*/
void homeAssistantDiscovery(void)
{
   myMqttClient.publish(myMqttHelper.getTopicHassDiscoveryClimate(),                   myMqttHelper.buildHassDiscoveryClimate(),                   true, MQTT_QOS);    // make HA discover the climate component
   myMqttClient.publish(myMqttHelper.getTopicHassDiscoveryBinarySensor(bsSensFail),    myMqttHelper.buildHassDiscoveryBinarySensor(bsSensFail),    true, MQTT_QOS);    // make HA discover the binary_sensor for sensor failure
   myMqttClient.publish(myMqttHelper.getTopicHassDiscoveryBinarySensor(bsState),       myMqttHelper.buildHassDiscoveryBinarySensor(bsState),       true, MQTT_QOS);    // make HA discover the binary_sensor for thermostat state
   myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySensor(sTemp),               myMqttHelper.buildHassDiscoverySensor(sTemp),               true, MQTT_QOS);    // make HA discover the temperature sensor
   myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySensor(sHum),                myMqttHelper.buildHassDiscoverySensor(sHum),                true, MQTT_QOS);    // make HA discover the humidity sensor
   myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySensor(sIP),                 myMqttHelper.buildHassDiscoverySensor(sIP),                 true, MQTT_QOS);    // make HA discover the IP sensor
   myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySensor(sCalibF),             myMqttHelper.buildHassDiscoverySensor(sCalibF),             true, MQTT_QOS);    // make HA discover the scaling sensor
   myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySensor(sCalibO),             myMqttHelper.buildHassDiscoverySensor(sCalibO),             true, MQTT_QOS);    // make HA discover the offset sensor
   myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySensor(sHysteresis),         myMqttHelper.buildHassDiscoverySensor(sHysteresis),         true, MQTT_QOS);    // make HA discover the hysteresis sensor
   myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySensor(sFW),                 myMqttHelper.buildHassDiscoverySensor(sFW),                 true, MQTT_QOS);    // make HA discover the firmware version sensor
   myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySwitch(swReset),             myMqttHelper.buildHassDiscoverySwitch(swReset),             true, MQTT_QOS);    // make HA discover the reset switch
   myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySwitch(swUpdate),            myMqttHelper.buildHassDiscoverySwitch(swUpdate),            true, MQTT_QOS);    // make HA discover the update switch
}

/* publish state topic in JSON format */
void mqttPubState(void)
{
   myMqttClient.publish( \
      myMqttHelper.getTopicData(), /* topic */ \
      myMqttHelper.buildStateJSON( /* JSON payload */\
         String(intToFloat(myThermostat.getFilteredTemperature()),1), \
         String(intToFloat(myThermostat.getFilteredHumidity()),1), \
         String(intToFloat(myThermostat.getThermostatHysteresis()),1), \
         String(boolToStringOnOff(myThermostat.getActualState())), \
         String(intToFloat(myThermostat.getTargetTemperature()),1), \
         String(myThermostat.getSensorError()), \
         String(boolToStringHeatOff(myThermostat.getThermostatMode())), \
         String(myThermostat.getSensorCalibFactor()), \
         String(intToFloat(myThermostat.getSensorCalibOffset()),0), \
         WiFi.localIP().toString(), \
         String(FIRMWARE_VERSION) ), \
      true, /* retain */ \
      MQTT_QOS /* QoS */\
   );
}

void handleWebServerClient(void)
{
   webServer.send(200, "text/plain", \
      "Name: "+ String(myConfig.name) + "\n" \
      "FW version: "+ String(FIRMWARE_VERSION) + "\n" \
      "Reset Reason: "+ String(ESP.getResetReason()) + "\n" \
      "Flash Size: "+ String(ESP.getFlashChipRealSize()) + "\n" \
      "Sketch Size: "+ String(ESP.getSketchSize()) + "\n" \
      "Free for Sketch: "+ String(ESP.getFreeSketchSpace()) + "\n" \
      "Free Heap: "+ String(ESP.getFreeHeap()) + "\n" \
      "Vcc: "+ String(ESP.getVcc()/1000.0) + "\n" \
      "WiFi Status: " + String(WiFi.status()) + "\n" \
      "WiFi RSSI: " + String(WiFi.RSSI()) + "\n" \
      "WiFi connects: " + String(WiFiConnectCounter) + "\n" \
      "MQTT Status: " + String( (myMqttClient.connected()) == true ? "connected" : "disconnected" ) + "\n" \
      "MQTT connects: " + String(MQTTConnectCounter) + "\n" \
      "MQTT Return Code: " + String(myMqttClient.returnCode()) + "\n" \
      "MQTT last error: " + String(myMqttClient.lastError()) \
   );
}

/* MQTT callback if a message was received */
void messageReceived(String &topic, String &payload)
{
   #ifdef CFG_DEBUG
   Serial.println("received: " + topic + " : " + payload);
   #endif

   if (topic == myMqttHelper.getTopicSystemRestartRequest())
   {
      #ifdef CFG_DEBUG
      Serial.println("Restart request received with value: " + payload);
      #endif
      if ( (payload == "true") || (payload == "1") )
      {
         SYSTEM_RESTART_REQUEST = true;
      }
   }

   /* HTTP Update */
   else if (topic == myMqttHelper.getTopicUpdateFirmware())
   {
      if ( (payload == "true") || (payload == "1") )
      {
         #ifdef CFG_DEBUG
         Serial.println("Firmware updated triggered via MQTT");
         #endif
         FETCH_UPDATE = true;
      }
   }

   /* check incoming target temperature, don't set same target temperature as new*/
   else if (topic == myMqttHelper.getTopicTargetTempCmd())
   {
      if (myThermostat.getTargetTemperature() != payload.toFloat())
      {
         /* set new target temperature for heating control, min/max limitation inside (string to float to int) */
         myThermostat.setTargetTemperature(floatToInt(payload.toFloat()));
      }
   }


   else if (topic == myMqttHelper.getTopicThermostatModeCmd())
   {
      if (String("heat") == payload)
      {
         myThermostat.setThermostatMode(TH_HEAT);
      }
      else if (String("off") == payload)
      {
         myThermostat.setThermostatMode(TH_OFF);
      }
      else
      {
          /* do nothing */
      }
   }


   else if (topic == myMqttHelper.getTopicChangeName())
   {
      #ifdef CFG_DEBUG
      Serial.println("New name received: " + payload);
      #endif
      if (payload != myMqttHelper.getName())
      {
         #ifdef CFG_DEBUG
         Serial.println("Old name was: " + myMqttHelper.getName());
         #endif
         myMqttHelper.changeName(payload);
      }
   }


   else if (topic == myMqttHelper.getTopicChangeSensorCalib())
   {
      #ifdef CFG_DEBUG
      Serial.println("New sensor calibration parameters received: " + payload);
      #endif

      int offset;
      int factor;

      if (splitSensorDataString(payload, &offset, &factor))
      {
         myThermostat.setSensorCalibData(factor, offset, true);
      }
   }
   else if (topic == myMqttHelper.getTopicChangeHysteresis())
   {
      #ifdef CFG_DEBUG
      Serial.println("New hysteresis parameter received: " + payload);
      #endif

      myThermostat.setThermostatHysteresis(payload.toInt());
   }
}

